from collections import Counter
from nltk.tokenize import word_tokenize
import glob
import nltk
from nltk.corpus import stopwords
import csv

path ='C:/Users/DELL PC/Desktop/New folder/hindi_data_set/*.txt'
files=glob.glob(path)

stop_words=set(stopwords.words('hindi'))


data=""
header=[]
happy=['दिव्य','महसूस','दैवीय','परमात्मा','रूप','जीवन','उपस्थिति','प्यार','प्रेम','भावना','हंसमुख','संतुष्ट','प्रसन्न','उन्मादपूर्ण','उत्तेजित','प्रसन्न','आनंदपूर्ण','आनंदित','उल्लसित','जीवंत','प्रमुदित','मस्त','शांतिपूर्ण','सुहानी','प्रसन्न','रोमांचित','उत्साहित','धन्य है','महाभाग','आनंदमय','ज़िंदादिल','शिकायत नहीं कर सकता','मोहित','टुकड़े करने वाला उपकरण','गरमागरम','सामग्री','खुशनुमा','ख़ुशियां मनानेवाला','ऊंची उड़ान','समलैंगिक','ज़िंदादिल','संतोष','नशे में चूर','विनोदी','हस रहा','रोशनी','अच्छे लग रहे हो','आनंदित','सातवें आसमान पर','क्रियात्मक','दिलेर','चंचल','शानदार','धूप','गुदगुदी','उत्सुकता की स्थिति','ऊपर','अत्यधिक प्रसन्नता की स्थिति']
sad=['भयानक','दुख','लग','महसूस','बारे','पता','इतना','वास्तव','समय','लोगों','बुरा','उदास','खराब','निराश','व्याकुल','नीचे','गंभीर','उदासी','दुखी','तंग किया','अमित्र','अप्रसन्न','परेशान','हतोत्साहित','असंतुष्ट','छोड़े','निराशाजनक','तप्त','दुर्भाग्य','बदकिस्मत',]
angry=['महसूस','घबराहट','कड़वा','गड़बड़ी','गुस्सा','लग','आज','बारे','रूप','थोड़ा','कड़वा','शैतान','लाद','अशिष्ट','खीजा हुआ','यहं से चले जाओ','निष्ठाहीन','अत्याचार','नाराज','ईर्ष्या','पागल','गुस्सा','नाराज','द्वेषपूर्ण','परेशान','लालची','क्रोधित','क्षुद्र','चकित','बेरहम','नाराज़','घृणास्पद','शत्रुतापूर्ण','तुच्छ','विला','सर्दी','घृणा करनेवाला']
fear=['डरा हुआ', 'चपेट में', 'भयभीत', 'उलझन में', 'संदिग्ध', 'हिलाकर रख दिया', 'अजीब', 'दुविधा में पड़ा हुआ', 'उत्तेजित', 'व्यथित', 'व्याकुल', 'भगदड़ का', 'पर शंका', 'uneast', 'चिंतित', 'हिचकते', 'अनिश्चित', 'भयभीत', 'घबराहट', 'अभिभूत', 'असुविधाजनक', 'अनिच्छुक', 'पर हमला किया', 'अरक्षित', 'चौंका', 'संदेहजनक', 'defencive', 'ऊपर मजबूत', 'अजीब', 'परेशान', 'धमकाया', 'डरा हुआ', 'डरावनी', 'बेचेन होना', 'दबाव', 'असुरक्षित', 'आसानी से डरनेवाला', 'धमकी दी', 'डरा हुआ', 'आशंका', 'उलझन में', 'उन्मत्त', 'डर', 'न्युरोटिक', 'चिंतित', 'काल', 'बेताब', 'अत्याचार', 'ढुलमुल', 'भीगी बिल्ली', 'दुविधा में पड़ा हुआ', 'बेचैन', 'अस्थिर', 'हिल', 'शर्मीला', 'अपर्याप्त', 'चिंतित', 'कायर', 'रोमांचित', 'डर लगता', 'मजबूर', 'संकोची', 'पागल', 'डर', 'डरा हुआ', 'चपेट में', 'भयभीत', 'उलझन में', 'संदिग्ध', 'हिलाकर रख दिया', 'अजीब', 'दुविधा में पड़ा हुआ', 'उत्तेजित', 'व्यथित', 'व्याकुल', 'भगदड़ का', 'पर शंका', 'uneast', 'चिंतित', 'हिचकते', 'अनिश्चित', 'भयभीत', 'घबराहट', 'अभिभूत', 'असुविधाजनक', 'अनिच्छुक', 'पर हमला किया', 'अरक्षित', 'चौंका', 'संदेहजनक', 'defencive', 'ऊपर मजबूत', 'अजीब', 'परेशान', 'धमकाया', 'डरा हुआ', 'डरावनी', 'बेचेन होना', 'दबाव', 'असुरक्षित', 'आसानी से डरनेवाला', 'धमकी दी', 'डरा हुआ', 'आशंका', 'उलझन में', 'उन्मत्त', 'डर', 'न्युरोटिक', 'चिंतित', 'काल', 'बेताब', 'अत्याचार', 'ढुलमुल', 'भीगी बिल्ली', 'दुविधा में पड़ा हुआ', 'बेचैन', 'अस्थिर', 'हिल', 'शर्मीला', 'अपर्याप्त', 'चिंतित', 'कायर', 'रोमांचित', 'डर लगता', 'मजबूर', 'संकोची', 'पागल', 'डर']
surprise=['हे भगवान', 'कमाल', 'कमाल', 'हैरान', 'गजब का', 'अप्रत्याशित घटना', 'धोखा दिया', 'आश्चर्य', 'अवाक', 'अचरज', 'जिज्ञासु', 'प्रभावित किया', 'अप्रत्याशित घटना', 'अजीब', 'ताज्जुब', 'अचरज', 'घबड़ाया हुआ', 'कमाल', 'हैरानी', 'हैरान', 'शानदार', 'अजीब', 'मजेदार', 'आश्चर्यचकित', 'अभिभूत', 'ऊटपटांग', 'ताज्जुब', 'चकित', 'रोमांचित', 'अप्रत्याशित', 'आश्चर्यचकित', 'कमाल', 'अचरज', 'आश्चर्य', 'हैरान', 'चकित', 'हैरानी', 'हे भगवान', 'वाह', 'अप्रत्याशित', 'अप्रत्याशित घटना', 'ताज्जुब', 'शानदार', 'विशाल', 'विस्तृत', 'आलीशान', 'शानदार', 'प्रशस्त', 'ठाठ का', 'शानदार', 'विराजमान', 'उज्ज्वल', 'चमकनेवाला', 'झलकनेवाला', 'कमाल की', 'स्तंभित', 'लकवावाला', 'सुन्न', 'अप्रत्याशित', 'कमाल', 'कमाल', 'हैरान', 'गजब का', 'अप्रत्याशित घटना', 'धोखा दिया', 'आश्चर्य', 'अवाक', 'अचरज', 'जिज्ञासु', 'प्रभावित किया', 'अप्रत्याशित घटना', 'अजीब', 'ताज्जुब', 'अचरज', 'घबड़ाया हुआ', 'कमाल', 'हैरानी', 'हैरान', 'शानदार', 'अजीब', 'मजेदार', 'आश्चर्यचकित', 'अभिभूत', 'ऊटपटांग', 'ताज्जुब', 'हैरान', 'चकित', 'हैरानी', 'हे भगवान', 'वाह', 'अप्रत्याशित', 'अप्रत्याशित घटना', 'ताज्जुब', 'शानदार', 'विशाल', 'विस्तृत', 'आलीशान', 'शानदार', 'प्रशस्त', 'ठाठ का', 'शानदार', 'विराजमान', 'उज्ज्वल', 'हे भगवान', 'कमाल', 'कमाल', 'हैरान', 'गजब का', 'अप्रत्याशित घटना', 'धोखा दिया', 'आश्चर्य', 'अवाक', 'अचरज', 'जिज्ञासु', 'प्रभावित किया', 'अप्रत्याशित घटना', 'अजीब', 'ताज्जुब', 'अचरज', 'घबड़ाया हुआ', 'कमाल', 'हैरानी', 'हैरान', 'शानदार', 'अजीब', 'मजेदार', 'आश्चर्यचकित', 'अभिभूत', 'ऊटपटांग', 'ताज्जुब', 'चकित', 'रोमांचित', 'अप्रत्याशित', 'आश्चर्यचकित', 'कमाल', 'अचरज', 'आश्चर्य', 'हैरान', 'चकित', 'हैरानी', 'हे भगवान', 'वाह', 'अप्रत्याशित', 'अप्रत्याशित घटना', 'ताज्जुब', 'शानदार', 'विशाल', 'विस्तृत', 'आलीशान', 'शानदार', 'प्रशस्त', 'ठाठ का', 'शानदार', 'विराजमान', 'उज्ज्वल', 'चमकनेवाला', 'झलकनेवाला', 'कमाल की', 'स्तंभित', 'लकवावाला', 'सुन्न', 'अप्रत्याशित', 'कमाल', 'कमाल', 'हैरान', 'गजब का', 'अप्रत्याशित घटना', 'धोखा दिया', 'आश्चर्य', 'अवाक', 'अचरज', 'जिज्ञासु', 'प्रभावित किया', 'अप्रत्याशित घटना', 'अजीब', 'ताज्जुब', 'अचरज', 'घबड़ाया हुआ', 'कमाल', 'हैरानी', 'हैरान', 'शानदार', 'अजीब', 'मजेदार', 'आश्चर्यचकित', 'अभिभूत', 'ऊटपटांग', 'ताज्जुब', 'हैरान', 'चकित', 'हैरानी', 'हे भगवान', 'वाह', 'अप्रत्याशित', 'अप्रत्याशित घटना', 'ताज्जुब', 'शानदार', 'विशाल', 'विस्तृत', 'आलीशान', 'शानदार', 'प्रशस्त', 'ठाठ का', 'शानदार', 'विराजमान', 'उज्ज्वल']


ch=0
cs=0
ca=0
cf=0
csup=0

for file in files:
    data=""
    print('bag of words of doc : ',file)
    print("**************************************************************")
    with open(file, encoding='utf-8') as s:
        for line in s:
            #print (i)
            data=data+line
        word_tokens = word_tokenize(data)

        filtered_data = [w for w in word_tokens if not w in stop_words]
        filtered_data =[]

        for w in word_tokens:
            if w not in stop_words:
                filtered_data.append(w)
        
        counter = Counter(filtered_data)
        counter=counter.most_common(10)
        for i in range(len(counter)):
            if counter[i][0] not in header:
                header.append(counter[i][0])
        #print(counter[0][0])
        print(counter)


#1-angry,2-happy,3-sad
print(header)
col=['happy','sad','angry','fear','suprise','class']
row=[]
i=0
with open("train_data.csv","w", encoding='utf-8') as f:
    wr = csv.writer(f)
    wr.writerow(col)
    for file in files:
        i=i+1
        with open(file, encoding='utf-8') as s:           
            for line in s:
                word_tokens = word_tokenize(line)
                for w in word_tokens:
                    if w in happy:
                        ch=ch+1
                    if w in sad:
                        cs=cs+1
                    if w in angry:
                        ca=ca+1
                    if w in fear:
                        cf=cf+1
                    if w in surprise:
                        csup=csup+1
                #row=row+ch+","+cs+","+ca+","+i
                row.append(ch)
                row.append(cs)
                row.append(ca)
                row.append(cf)
                row.append(csup)
                row.append(i)
                wr.writerow(row)
                row=[]
                ch=0
                cs=0
                ca=0
                cf=0
                csup=0
            
        
            
            
    




